{"config": [{"config": {"name": "conv1d_2", "batch_input_shape": [null, 4, 2], "dtype": "float32", "trainable": true, "kernel_regularizer": null, "dilation_rate": [1], "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "filters": 64, "kernel_size": [3], "activation": "relu", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "strides": [1], "use_bias": true, "kernel_constraint": null, "padding": "valid"}, "class_name": "Conv1D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_4", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "units": 64, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_5", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "units": 32, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}, {"config": {"name": "dense_6", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "units": 1, "kernel_constraint": null, "use_bias": true}, "class_name": "Dense"}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}